БухЭксп/Catalogs/CW_ВнешниеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВнешниеПодписки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыВнешнихПодписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетаданноеПодписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыВнешнихПодписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыВнешнихПодписок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбработчикПередЗаписью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикПриПроведении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикПередУдалением</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВнешниеПодписки/Forms/ФормаДереваПодписок/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьДеревоНаСервере()

	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Метаданное КАК Метаданное,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка КАК Подписка,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки КАК Событие,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.Порядок КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПередЗаписью
	               |			ТОГДА 0
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПриЗаписи
	               |			ТОГДА 1
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПриПроведении
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК ПорядокСобытия,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.НеИспользуется КАК НеИспользуется
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки.ИсточникиПодписки КАК CW_ВнешниеПодпискиИсточникиПодписки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокСобытия,
	               |	Порядок
	               |ИТОГИ ПО
	               |	Метаданное
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПередЗаписью", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПередЗаписью);
	Запрос.УстановитьПараметр("ПриЗаписи", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПриЗаписи);
	Запрос.УстановитьПараметр("ПриПроведении", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПриПроведении);
	
	ВыборкаМетаданное = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоПодписок",Тип("ДеревоЗначений"));
	
	Пока ВыборкаМетаданное.Следующий() Цикл  
		СтрокаДерева = ДеревоЗначений.Строки.Добавить();
		СтрокаДерева.МетаданноеПодписка	= ВыборкаМетаданное.Метаданное;
		СтрокаДерева.ВерхнийУровень 	= истина;
		
		ВыборкаПодписки = ВыборкаМетаданное.Выбрать();
		
		Пока ВыборкаПодписки.Следующий() Цикл
			СтрокаПодписки = СтрокаДерева.Строки.Добавить();
			СтрокаПодписки.МетаданноеПодписка 	= ВыборкаПодписки.Подписка;
			ЗаполнитьЗначенияСвойств(СтрокаПодписки, ВыборкаПодписки);
		КонецЦикла;
		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоПодписок");
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомандаЗаполнитьДеревоНаСервере();

КонецПроцедуры
